{"daily-goals/day-1":{"title":"day 1","links":[],"tags":[],"content":""},"daily-goals/index":{"title":"Daily goals","links":[],"tags":[],"content":"Starting today, I want to document my journey to making my first million dollars. I will set goals each day before I go to bed, follow through the next day when I wake up, and repeat the process until I reach my goal.\nIn order to achieve my goals, I have to be very intentional about how I spend my time, what I do, and the people I surround myself with.\nEvery night, I will evaluate whether I’ve achieved my daily goals or not, and set new goals for the next day. If I don’t complete my goals, I will have to start my day with a 5k morning run the next morning."},"discipline":{"title":"Discipline","links":[],"tags":[],"content":"Do the hard work, especially when you don’t feel like it\nHere’s my daily routine:\nMorning\n\n7:00 AM: Wake up, get out of bed, and walk straight into cold shower.\n7:05 AM: Brush my teeth, make my bed, and meditate for 5 minutes.\n7:10 AM: On a paper notebook:\n\nWrite down what I’m grateful for\nWhat I want to achieve today\nWhat I’m going to do to achieve it\n\n\n7:15 AM: Go for a morning walk or run under direct sunlight for 15 minutes.\n7:45 AM: Take a shower, get dressed, drink a cup of coffee, and eat breakfast.\n8:00 AM: Start working on the most mentally challenging task for the day.\n\nAfternoon\n\n12:00 PM: Eat lunch and take supplements.\n\nFish oil\nVitamin D3\nVitamin B Complex\n\n\n3:00 PM: Take an hour break to do chores, read a book, or pursue a hobby.\n4:00 PM: More work.\n\nEvening\n\n6:00 PM: Hit the gym and train for 1 hour.\n7:00 PM: Drink a protein shake and eat dinner.\n8:00 PM: More work.\n\nNight\n\n10:00 PM: Stop working and do some journaling.\n11:00 PM: Go to bed.\n\n\nSome non-negotiable hard rules:\n\nNo social media before 9:00 AM.\nNo meetings before 12:00 PM.\nNo scrolling on social media at any given time.\n\nIt is a tool for making money, not for entertainment.\n\n\n\n\nReferences:\n\nwww.youtube.com/watch\nwww.youtube.com/watch\n"},"index":{"title":"Welcome to my blog!","links":["daily-goals","discipline"],"tags":[],"content":"My name is Allen Lin and I’m a 4th-year CS student at Northeastern University. I was born in Taiwan and I moved to the United States when I was 13. I’m deeply passionate about AGI, tech entrepreneurship, and education. My goal is to accelerate innovation and help solve the most significant challenges of the 21st century - namely, understanding how the human brain works.\nI’m currently building a consumer social startup called Fireplace and managing a Boston-based startup community called rev. I love learning and sharing knowledge, so I hope you can find something useful in my blog.\nPlease feel free to reach out to me if you have any questions or just want to chat!\nMy Journal\nDaily goals\nMy Notes\nDiscipline"}}