{"discipline":{"title":"Discipline","links":[],"tags":[],"content":"Do the hard work, especially when you don’t feel like it\nHere’s my daily routine:\nMorning\n\n7:00 AM: Wake up, get out of bed, drink a glass of water, and walk straight into cold shower.\n7:05 AM: Brush my teeth, make my bed, and meditate for 5 minutes.\n7:10 AM: On a paper notebook, write down:\n\nWhat I’m grateful for\nWhat I want to achieve today\nWhat I’m going to do to achieve it\n\n\n7:15 AM: Go for a morning walk or run under direct sunlight for 15 minutes.\n7:45 AM: Take a shower, get dressed, and eat breakfast.\n8:00 AM: Start working on the most mentally challenging task for the day.\n10:00 AM: Take a short break and drink a cup of coffee.\n\nAfternoon\n\n12:00 PM: Eat lunch and take supplements.\n\nFish oil\nVitamin D3\nVitamin B Complex\n\n\n3:00 PM: Take an hour break to do chores, read a book, or pursue a hobby.\n4:00 PM: More work.\n\nEvening\n\n6:00 PM: Hit the gym and train for 1 hour.\n7:00 PM: Drink a protein shake and eat dinner.\n8:00 PM: More work.\n\nNight\n\n10:00 PM: Stop working and do some journaling.\n11:00 PM: Go to bed.\n\n\nSome non-negotiable hard rules:\n\nNo social media before 9:00 AM.\nNo meetings before 12:00 PM.\nNo scrolling on social media at any given time.\n\nIt is a tool for making money, not for entertainment.\n\n\n\n\nReferences:\n\nwww.youtube.com/watch\nwww.youtube.com/watch\n"},"goals/day-1":{"title":"day 1","links":[],"tags":[],"content":"Challenge\n\n Write about rev’s 2024 vision\n\nTasks\n\n Record Morning Walk &amp; Talk\n Edit and upload Morning Walk &amp; Talk\n Read two chapters of The 5 AM Club\n Clean my room\n Catch up with Eren\n Catch up with Shivam\n Reach out to Vivian, Sejin, and KP about marketing (cc Nick)\n Complete college auth feature for Fireplace\n Complete hold-to-record feature for Wakeup Club\n\nReflection\nToday feels very different from the last couple of days. After doing a 5-minute meditation this morning, I feel more self-aware of my surroundings and of the things I say and do. It almost feels like what I was doing before was on autopilot, and now I’m more present. For example, it almost feels like all the startup &amp; builder stuff that I was doing was just a distraction from what I really wanted to do, which is to create value in this world. By being more intentional about my actions and how my time is spent, I feel like I’m listening to myself more and doing things that I genuinely find interesting and valuable. “Working hard for something we don’t care about is called stress; working hard for something we love is called passion.” I want to find my true passion, and the first step is to be true to myself and listen to myself."},"goals/day-2":{"title":"day 2","links":[],"tags":[],"content":"\nMy daily goals from yesterday were too ambitious and I didn’t complete all of them. I will start my day with a 5k morning run today and set more realistic goals and focus on completing one task for each category.\n\nChallenge\n\n Write about Fireplace’s 2024 vision\n\nMorning Tasks\n\n 5k morning run\n (3hr) Complete college auth feature for Fireplace\n Read two chapters of The 5 AM Club\n (1hr) Record and uplaod new episode of Morning Walk &amp; Talk\n\nAfternoon Tasks\n\n Reach out to Vivian, Sejin, and KP about marketing (cc Nick)\n (1hr) Migrate rev’s Notion workspace\n (3hr) Complete hold-to-record feature for Wakeup Club\n Write a script for the next episode\n 30-minute weight training\n"},"goals/index":{"title":"Goals","links":[],"tags":[],"content":"Starting today, I want to document (build in public) my journey to making my first million dollars. I will set goals each day before I go to bed, follow through the next day when I wake up, and repeat the process until I reach $1M.\nIn order to achieve my goals, I have to be very intentional about how I spend my time, what I do, and the people I surround myself with.\nEvery night, I will evaluate whether I’ve achieved my daily goals or not, and set new goals for the next day. If I don’t complete my goals, I will have to start my day with a 3k morning run the next morning."},"index":{"title":"Welcome to my blog!","links":["goals","vision","discipline"],"tags":[],"content":"My name is Allen Lin and I’m a 4th-year CS student at Northeastern University. I was born in Taiwan and I moved to the United States when I was 13. I’m deeply passionate about AGI, tech entrepreneurship, and education. My goal is to accelerate innovation and help solve the most significant challenges of the 21st century - namely, understanding how the human brain works.\nI’m currently building a consumer social startup called Fireplace and managing a Boston-based startup community called rev. I love learning and sharing knowledge, so I hope you can find something useful in my blog.\nPlease feel free to reach out to me if you have any questions or just want to chat!\nMy Journal\n\nGoals\nVision\n\nMy Notes\n\nDiscipline\n"},"vision/2024/fireplace":{"title":"Fireplace","links":[],"tags":[],"content":"Today is May 2nd, 2024, and we have eight months left in the year. I think it’s more realistic to split our goals into two parts, each spanning 4 months, or a quarter.\nFor the first quarter, we’re going to focus on fine-tuning features on the app to make sure they meet all the needs of the clubs we’ve onboarded so far, including the Jiu Jitsu Club, AI Club, rev, IDEA Venture Accelerator, Sherman Center, and Huntington Angels Network. Once we’ve launched v2 of the app, we’re going to focus on user acquisition and onboarding more clubs to the platform before the new semester starts.\nFor the second quarter, we’re going to focus on growth and expanding to other universities, including Boston University, Harvard, MIT, Babson College, and Tufts, etc. The goal is to completely dominate the Boston college market and become the go-to platform for student organizations to manage their clubs and for students to discover events and meet new people.\nThese are the two main focuses:\n\nCommunity Management: Make sure that the process of hosting events and managing members are as seamless as possible. We will also create a web portal that lets community admins view their club analytics and manage their club easily on a web-based dashboard.\nUser Acquisition: We are going to focus on onboarding more student organizations over the summer and reaching out to first-year students who are eager to meet other students on campus. We want to ensure that Fireplace becomes the go-to platform for these first-year students to stay up to date with what’s happening on campus. Slack and Discord are not optimized for the mobile experience, so we aim to change that. The goal is to help students meet others who share the same niche interests, helping them build a community and network that will last throughout their college years.\n"},"vision/2024/rev":{"title":"rev","links":[],"tags":[],"content":"rev started as a community of builders and founders back in March 2024. The goal was simply to create a community where technical founders can come together to learn, build, and bounce ideas with each other. Building alone is difficult, and I experienced that in firsthand when I was building Fireplace during my gap year in college.\nMy goal for rev in 2023 was to grow rev to 100 members and host a hackathon. We didn’t quite host a hackathon but grew membership to over 300 members on Slack, helped 10 teams go from 0 to 1 (including CareWallet, Bibite, Dapper, etc), hosted two events with Cory Levy, hosted rev Hacker House with Startup Exchange, incubated over 50 projects from 0 to 1, and hosted rev launch - highlighting our impact on the Northeastern University entrepreneurial ecosystem.\nIn 2024, I want to take rev to the next level and grow to 1,000 members. Here is how I plan to do it:\n\n\nCommunity: We are a community-first organization, so we will continue to focus on building our in-person community at Northeastern University by hosting weekly co-working sessions, social media highlights of our members, and flagship events such as rev launch and rev hacker house. We will also continue to grow our online community by posting weekly updates/newsletters, hosting office hours, and promoting rev capsule.\n\n\nVerticals: Since 2024, we’ve pivoted rev to be a community of builders, founders, creatives, and researchers. However, we want to narrow our focus and make sure we provide real value to our members. Instead of being too broad and focusing on members of all levels at once, rev will be the catalyst to help our members go from 0 to 1 in their respective fields in one month.\n\nBuilders: 0 to 1 user\nFounders: 0 to 1 dollar\nCreatives: 0 to 1 follower\nResearchers: 0 to 1 model\n\n\n\nLeadership: We will have a new leadership structure consisting of 2 managing directors, 2 community directors, and several cohort directors.\n\nManaging Directors:\n\nOperations\nLogistics\nPartnerships\nStrategy\n\n\nCommunity Directors\n\nEvents\nCommunity Engagement\nSocial Media\n\n\nCohort Directors:\n\nCohort Program\nOffice Hours\nLightining Talks\nrev capsule\n\n\n\n\n\nMonetization: We will start monetizing by implementing multiple revenue streams such as selling merchandise, monthly membership fees, office hours, and online courses (rev capsule). However, rev cohort members will get access to everything for free if they are selected into our program.\n\n"},"vision/index":{"title":"Vision","links":["vision/2024"],"tags":[],"content":"\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTermLengthShort-term goalswithin 1 yearMid-term goals1-3 yearsLong-term goals5-10 years or longer\nShort-term goals\n\n Reach 10,000 users on Fireplace\n Set up a social content management system for Morning Walk &amp; Talk\n Reach 1,000 subscribers on YouTube\n Pass IDEA Go Stage for Fireplace\n\nMid-term goals\n\n Graduate from Northeastern University\n Make my first million dollars\n Reach 1,000 members in rev\n\nLong-term goals\n\n Sell my first company\n Start an educational organization to help young entrepreneurs\n\nUpdated on May 1, 2024\n2024"}}